Product - Investment Income Reporting/Product - NRT/sample messages/RetrieveStatus_Request_with_submission_key.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <a:Action xmlns:a="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/RetrieveStatus</a:Action>
    </soap:Header>
    <soap:Body>
        <ret:RetrieveStatus xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnStatusRequestMsg>
                <ret1:RetrieveStatusRequestWrapper xmlns:ret1="https://services.ird.govt.nz/GWS/Returns/:types/RetrieveStatusRequest">
                    <ret2:retrieveFormInfoRequest xmlns:ret2="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                        <com:softwareProviderData xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <com:softwareProvider>softwareProvider</com:softwareProvider>
                            <com:softwarePlatform>softwarePlatform</com:softwarePlatform>
                            <com:softwareRelease>v1</com:softwareRelease>
                        </com:softwareProviderData>
                        <com:identifier xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v2" IdentifierValueType="ACCIRD">123768973</com:identifier>
                        <com:accountType xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v2">NRT</com:accountType>
                        <ret2:periodEndDate>2019-04-30</ret2:periodEndDate>
                        <ret2:majorFormType>NRT</ret2:majorFormType>
                        <ret2:submissionKey>555555</ret2:submissionKey>
                    </ret2:retrieveFormInfoRequest>
                </ret1:RetrieveStatusRequestWrapper>
            </ret:ReturnStatusRequestMsg>
        </ret:RetrieveStatus>
    </soap:Body>
</soap:Envelope>
